{
  "success": true,
  "data": {
    "name": "Inder",
    "lastName": "Singh",
    "fullName": "Mr. Inderpal Singh",
    "role": "Full Stack Developer",
    "profilePic": "/assets/images/profile.jpg",
    "linkedin": "https://www.linkedin.com/in/ips17009",
    "twitter": "https://twitter.com/pali170",
    "facebook": "https://www.facebook.com/ips17009",
    "instagram": "https://www.instagram.com/ip__singh",
    "intro": "<strong>Hi I'm Inder Pal Singh</strong> from Punjab and I'm having 8 years of experience in development, starting my career with PHP development I learn different technologies and frameworks and after a long year of experience, learning, efforts now I'm a Full Stack Developer.",
    "description": "Starting my career as a PHP developer I worked with different technologies, frameworks and developed many plugins, themes in WordPress and then I switched to JS frameworks back in 2017 (Angular & React), afterwards I started working with backend & frontend technologies both and now I'm Full Stack Developer in the field of website and app development, having knowledge of 6 different programming languages and many more on my way.",
    "educations": [
      {
        "title": "Bachelor Degree of Computre Science & Information Technology (BSC.IT)",
        "institute": "Kalinga University",
        "startDate": "2014-06-01T13:13:13.0Z",
        "endDate": "2016-06-01T13:13:13.0Z",
        "state": "Chhattisgarh",
        "totalSems": 4,
        "description": "After completing my Diploma I started my career in development and then after few months, I have taken admission to BSC.IT 2nd year based on my Diploma. I got 67.14% in this course and learn a lot about Information technology.",
        "points": ["Math", "Made project of shopping cart"]
      },
      {
        "title": "Diploma in Information Technology (DIT)",
        "institute": "Kalinga University",
        "startDate": "2012-10-01T13:13:13.0Z",
        "endDate": "2013-10-01T13:13:13.0Z",
        "state": "Punjab",
        "totalSems": 2,
        "description": "After completing my Senior secondary education I have taken admission in the field of information technology to know more about the computer. I got 73.42% in this course with good kickstart things in my hand. I always wanted to be a Software engineer but didn't know where to start, this course helps me to kickstart my career with Industrial training and coaching in PHP, Mysql.",
        "points": ["Industrial Training", "Communicating Skills", "PHP, Mysql training"]
      },
      {
        "title": "Senior Secondary School",
        "institute": "3b1 Govt. Modal Senior Secondary, Mohali",
        "board": "PSEB",
        "startDate": "2012-10-01T13:13:13.0Z",
        "endDate": "2013-10-01T13:13:13.0Z",
        "state": "Punjab",
        "totalSems": 2,
        "description": "I completed my Senior Secondary education in 2012 with the stream of Non-Medical, I always love to take challenges before I have taken an entry in commerce stream but due to the boring CA things I was looking to learn more about Science and Technology and then I choose to go with Non-Medical, I got 70% in this course.",
        "points": ["Non-Medical", "Math", "Science", "Cricket player of school team"]
      },
      {
        "title": "High School",
        "institute": "JVS (Sectore-71 Mohali)",
        "board": "PSEB",
        "startDate": "2012-10-01T13:13:13.0Z",
        "endDate": "2013-10-01T13:13:13.0Z",
        "state": "Punjab",
        "totalSems": 2,
        "description": "I completed High school in 2010 with 70.21% in the subject. During school time I participated in different outdoor sports events.",
        "points": ["Math","Cricket player of school team"]
      }
    ],
    "experiences": [
      {
        "title": "Technical Lead Manager",
        "description": "My responsibility was to lead the team of technical developers and help them to solve the problems. I was communicating with clients, listen to their thoughts and discuss all the project-related stuff. I gave weekly demos and discuss the next milestones with them to deliver the quality and on-time of work is my goal.",
        "company": "Illuminz",
        "address": "#F-213 Phase-8, Mohali, Punjab, India",
        "startDate": "2018-06-07T13:13:13.0Z",
        "endDate": "2021-05-31T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          
        ]
      },
      {
        "title": "Senior Software Engineer",
        "description": "I worked there as a Senior software engineer where I had to work on different technologies and communicate with sales and team leads to giving the right directions, timeline, and availabilities.",
        "company": "Deftsoft",
        "address": "#E-286 Phase-8 A, Mohali, Punjab, India",
        "startDate": "2017-01-23T13:13:13.0Z",
        "endDate": "2018-05-19T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          "PHP",
          "JS"
        ]
      },
      {
        "title": "Senior Web Developer",
        "description": "I started my development journey from Webclouds as a trainee in PHP development, within 20days I covered the syllabus given to me and I was assigned to live projects, I made the first project in WordPress single handled and completed that within 4 days.",
        "company": "Webclouds",
        "address": "SCO 34-C, Kharar, Mohali, Punjab, India",
        "startDate": "2013-01-23T13:13:13.0Z",
        "endDate": "2016-10-03T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          "PHP",
          "JS",
          "Wordpress",
          "Magento",
          "Drupal",
          "Joomla",
          "Ontraport",
          "Volusion",
          "ClickBank"
        ]
      }
    ],
    "skills": [
      {
        "name": "Node.JS",
        "percent": 100,
        "slug": "nodejs"
      },
      {
        "name": "Angular",
        "percent": 100,
        "slug": "angular"
      },
      {
        "name": "ReactJS",
        "percent": 100,
        "slug": "react"
      },
      {
        "name": "PHP",
        "percent": 100,
        "slug": "php"
      },
      {
        "name": "Python",
        "percent": 90,
        "slug": "python"
      },
      {
        "name": "Ionic",
        "percent": 90,
        "slug": "ionic"
      },
      {
        "name": "React Native",
        "percent": 80,
        "slug": "reactnative"
      },
      {
        "name": "PhoneGap",
        "percent": 70,
        "slug": "phonegap"
      },
      {
        "name": "SQL (MySql, MsSql, MariaDB)",
        "percent": 100,
        "slug": "mysql"
      },
      {
        "name": "NoSQL (MongoDB, Dynamodb)",
        "percent": 100,
        "slug": "nosql"
      },
      {
        "name": "HTML",
        "percent": 100,
        "slug": "html"
      },
      {
        "name": "CSS",
        "percent": 100,
        "slug": "css"
      },
      {
        "name": "AWS (IAAS, PAAS, SAAS, RDS)",
        "percent": 95,
        "slug": "aws"
      },
      {
        "name": "Google Cloud (Instances)",
        "percent": 80,
        "slug": "gcloud"
      },
      {
        "name": "Cpanels (SSH, Files)",
        "percent": 100,
        "slug": "cpanel"
      },
      {
        "name": "Docker",
        "percent": 70,
        "slug": "docker"
      },
      {
        "name": "Kubernetes",
        "percent": 60,
        "slug": "kubernetes"
      },
      {
        "name": "Wordpress",
        "percent": 100,
        "slug": "wordpress"
      },
      {
        "name": "Laravel",
        "percent": 95,
        "slug": "laravel"
      },
      {
        "name": "Magento (v1 & v2)",
        "percent": 90,
        "slug": "magento"
      },
      {
        "name": "Bigcommerce",
        "percent": 90,
        "slug": "bigcommerce"
      },
      {
        "name": "Codeigniter",
        "percent": 80,
        "slug": "codeigniter"
      },
      {
        "name": "CakePHP",
        "percent": 80,
        "slug": "cakephp"
      },
      {
        "name": "Shopify",
        "percent": 80,
        "slug": "shopify"
      },
      {
        "name": "Drupal",
        "percent": 70,
        "slug": "drupal"
      },
      {
        "name": "Opencart",
        "percent": 70,
        "slug": "opencart"
      },
      {
        "name": "Nationbuilder",
        "percent": 60,
        "slug": "nationbuilder"
      }
    ],
    "projects": [
      {
        "name": "Motoview",
        "link": "https://motoview.com",
        "image": "motoview.png",
        "description": "A complete website with a listing of cars from different motor shows, the best automobile companies from around the world showcase their latest designs and concepts for cars of the future. We are fetching a list of different cars from the Iceberg API and then storing all of them inside Motoview database. We can compare the multiple cars side by side to see all the features available, also users can signup and like/unlike, comment on the different parts of the car.",
        "technologies": ["Angular", "Lumen", "Mysql"]
      },
      {
        "name": "Ethnico",
        "link": "https://ethnico.in",
        "image": "ethnico.png",
        "description": "Ethnico presents itself as a holistic platform for both customized and readymade clothing. It connects artisans, boutiques, and clothing houses across Chennai, to people looking for bespoke stitching and customized tailoring experiences. Ethnico is a wholesome platform for both the end-users and the vendors. It gives users the feasibility to shop for readymade garments and bespoke stitching options, without having to step out of their homes.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Lex Chatbot",
        "image": "lexbot.png",
        "description": "The chatbot is made to take the feedback for the different Canadian surveys, based on user response it detects the sentiment of the line, if it's positive or negative response based on that it asks the next question to get the more details about their experience, it has progress bar until it reaches the certain number of words the questions continue asking for 5 times to the user. I made a unique Lambda/Python script to achieve this and prepare the sentence by using English grammar and syntax.",
        "technologies": ["AWS Lambda", "Python", "DynamoDB"]
      },
      {
        "name": "Delivery Papa",
        "link": "http://dp.illuminz.com",
        "image": "delivery-papa.png",
        "description": "It's a multi-vendor system to sell food online by different companies from their outlets, every individual has a separate database to sell/track their orders and then further it can be assigned to delivery partners through different delivery services with live tracking, it has table reserve/booking option and POS facility let users to directly purchase food from restaurant. It provides a loyalty program so based on user purchases the tier gets updated and based on that users will get exciting offers, discounts. Companies can promote their business by using the social and marketing campaigns.",
        "technologies": ["Angular", "NodeJs", "React", "NextJS", "Mysql", "MongoDB"]
      },
      {
        "name": "Upped Events",
        "link": "http://uppedevents.com",
        "image": "upped.png",
        "description": "It's full fledge event management system from selling tickets online to manage Event owners, Vendors, Staff, Customers. Users can see the currently running event in their area and book for their event by purchasing a ticket or slot. Event owners or companies can create an event and add their Vendors or source from Upped and then further staff will be assigned to vendors and they can have their staff as well, from ticket checking to items purchasing everything is managed in the system with a different kind of analytics to let the companies view full insight of their business.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Gigipo",
        "link": "https://dev.gigipo.com",
        "image": "gigipo.png",
        "description": "It's online coaching website where Teachers can register and offer their different types of classes related to Art, Music and many other categories, users will see the list of all the classes and book for the slot or start an instant class with teacher by paying the amount, then it will create a new room for the user and teacher to join through video call which uses the techonology JITSI Meet (Open source video conferencing), and then teacher can share the notes and other information with the user. It has gift a class feature which helps users to purchase and pay for other users class.",
        "technologies": ["React", "NodeJs", "Mysql", "MongoDB"]
      }
    ]
  }
}