{
  "success": true,
  "data": {
    "name": "Inder",
    "lastName": "Singh",
    "phone": "8591773009",
    "phoneCode": "+91",
    "email": "ips13009@gmail.com",
    "fullName": "Mr. Inderpal Singh",
    "address": "Mohali, Punjab",
    "role": "Full Stack Developer",
    "totalExperience": 12,
    "profilePic": "/assets/images/profile.jpg",
    "linkedin": "https://linkedin.com/in/ips13",
    "twitter": "",
    "facebook": "",
    "instagram": "",
    "intro": "<strong>Senior Full Stack Developer</strong> with 12+ years of experience designing and scaling high-performance web applications. Expert in JS, Angular, React, Node.js, Java and Python, with a proven track record of delivering mission-critical solutions for industry giants including events.com, Cisco, and Lucid Motors.",
    "description": "Specialized in migrating large-scale datasets (2TB+), optimizing API architecture, and driving Agile adoption to increase team productivity by 30%.",
    "educations": [
      {
        "title": "Bachelor of Science in IT (BSc IT)",
        "institute": "Kalinga University",
        "startDate": "2014-01-01T00:00:00.0Z",
        "endDate": "2016-01-01T00:00:00.0Z",
        "state": "Raipur, India",
        "totalSems": 4,
        "description": "specializing in Information Technology, focusing on software engineering principles, database management, and network security.",
        "points": []
      },
      {
        "title": "Diploma in Information Technology (DIT)",
        "institute": "Punjab Infotech",
        "startDate": "2012-01-01T00:00:00.0Z",
        "endDate": "2013-01-01T00:00:00.0Z",
        "state": "Mohali, Punjab",
        "totalSems": 2,
        "description": "Established a strong technical foundation in computer science fundamentals and application development.",
        "points": []
      }
    ],
    "experiences": [
      {
        "title": "Senior Full Stack Developer (Contract)",
        "description": "Engagement with key clients: events.com, Cisco, Lucid Motors, Upped Events. \n• Architected a comprehensive event management ecosystem managing end-to-end ticket sales, staff coordination, and operational logistics. \n• Spearheaded the development of Cisco's award-winning \"Master Boot Record (MBR)\" application. \n• Engineered a global, multi-country Point of Sale (POS) system for Lucid Motors utilizing Ionic, Node.js, and React. \n• Led the zero-downtime migration of Canada's largest survey platform, transferring 2 TB of data from legacy SQL to a high-performance, indexed MySQL architecture on AWS. \n• Developed 'Motoview', a feature-rich car listing platform using Angular and Laravel.",
        "company": "Professional Services",
        "address": "Remote / Mohali, India",
        "startDate": "2021-06-01T00:00:00.0Z",
        "endDate": "Present",
        "projects": [],
        "roles": [],
        "technologies": [
          "Angular",
          "React",
          "NodeJs",
          "Docker",
          "AWS",
          "Git",
          "Ionic",
          "Laravel"
        ]
      },
      {
        "title": "Technical Lead",
        "description": "Directed a team of developers in building scalable enterprise applications, instituting rigorous code review processes, and ensuring on-time delivery of critical milestones. \n• Championed Agile adoption, resulting in a measurable 30% increase in team productivity within six months. \n• Served as the primary technical liaison for clients, effectively translating complex business requirements into actionable technical specifications.",
        "company": "Illuminz",
        "address": "Mohali, Punjab",
        "startDate": "2018-06-01T00:00:00.0Z",
        "endDate": "2021-05-01T00:00:00.0Z",
        "projects": [],
        "roles": [],
        "technologies": [
          "Angular",
          "NodeJs",
          "PHP"
        ]
      },
      {
        "title": "Senior Software Developer",
        "description": "Collaborated closely with sales and executive leadership to define technical strategy and roadmaps for a diverse portfolio of applications. \n• Successfully delivered and maintained multiple customer-facing applications, ensuring high availability and performance. \n• Managed end-to-end User Acceptance Testing (UAT) and deployment pipelines to guarantee defect-free releases.",
        "company": "Webclouds",
        "address": "Mohali, Punjab",
        "startDate": "2013-10-01T00:00:00.0Z",
        "endDate": "2018-05-01T00:00:00.0Z",
        "projects": [],
        "roles": [],
        "technologies": [
          "PHP",
          "JS",
          "Wordpress",
          "Magento"
        ]
      }
    ],
    "skills": [
      {
        "name": "Node.JS",
        "percent": 100,
        "slug": "nodejs"
      },
      {
        "name": "Angular",
        "percent": 100,
        "slug": "angular"
      },
      {
        "name": "ReactJS",
        "percent": 100,
        "slug": "react"
      },
      {
        "name": "PHP (Laravel)",
        "percent": 100,
        "slug": "php"
      },
      {
        "name": "Python",
        "percent": 90,
        "slug": "python"
      },
      {
        "name": "Java",
        "percent": 80,
        "slug": "java"
      },
      {
        "name": "Ionic",
        "percent": 90,
        "slug": "ionic"
      },
      {
        "name": "React Native",
        "percent": 80,
        "slug": "reactnative"
      },
      {
        "name": "SQL (MySql, PostgreSQL)",
        "percent": 100,
        "slug": "mysql"
      },
      {
        "name": "NoSQL (MongoDB)",
        "percent": 100,
        "slug": "nosql"
      },
      {
        "name": "HTML5",
        "percent": 100,
        "slug": "html"
      },
      {
        "name": "CSS3",
        "percent": 100,
        "slug": "css"
      },
      {
        "name": "AWS",
        "percent": 95,
        "slug": "aws"
      },
      {
        "name": "Docker",
        "percent": 80,
        "slug": "docker"
      },
      {
        "name": "Jenkins / CI/CD",
        "percent": 70,
        "slug": "jenkins"
      },
      {
        "name": "Microservices",
        "percent": 80,
        "slug": "microservices"
      },
      {
        "name": "Wordpress",
        "percent": 100,
        "slug": "wordpress"
      },
      {
        "name": "Shopify",
        "percent": 80,
        "slug": "shopify"
      },
      {
        "name": "Laravel",
        "percent": 100,
        "slug": "laravel"
      },
      {
        "name": "Magento",
        "percent": 90,
        "slug": "magento"
      },
      {
        "name": "CakePHP",
        "percent": 85,
        "slug": "cakephp"
      }
    ],
    "projects": [
      {
        "name": "Motoview",
        "link": "https://motoview.com",
        "image": "motoview.png",
        "description": "Motoview is a premier digital showroom aggregation platform. We integrate with the Iceberg API to curate a diverse collection of vehicles from prestigious international motor shows. The platform empowers users with advanced comparison tools, social interaction features (likes/dislikes), and a robust commenting system, creating an engaging community for automotive enthusiasts.",
        "technologies": ["Angular", "Lumen", "Mysql"]
      },
      {
        "name": "Ethnico",
        "link": "https://ethnico.in",
        "image": "ethnico.png",
        "description": "Ethnico is a pioneering marketplace bridging the gap between traditional artisans and modern consumers. The platform unifies boutiques, clothing houses, and skilled artisans across Chennai, offering a seamless digital storefront for bespoke tailoring and readymade ethnic wear. It revolutionizes the local textile industry by bringing the complete boutique experience to the user's doorstep.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Lex Chatbot",
        "image": "lexbot.png",
        "description": "An intelligent sentiment-analysis chatbot engineered for large-scale Canadian survey data. Leveraging AWS Lambda and Python, the bot dynamically adapts its questioning path based on real-time sentiment analysis of user responses. It features a sophisticated natural language processing script to ensure grammatical accuracy and syntax structure, enhancing user engagement and data quality.",
        "technologies": ["AWS Lambda", "Python", "DynamoDB"]
      },
      {
        "name": "Delivery Papa",
        "link": "http://dp.illuminz.com",
        "image": "delivery-papa.png",
        "description": "A scalable multi-vendor food delivery and management ecosystem. The platform supports complex operations including individual vendor database management, multi-provider delivery dispatching with real-time tracking, table reservations, and POS integration. It features a gamified loyalty application that rewards user engagement with tier-based benefits, alongside a comprehensive marketing suite for vendor promotions.",
        "technologies": ["Angular", "NodeJs", "React", "NextJS", "Mysql", "MongoDB"]
      },
      {
        "name": "Upped Events",
        "link": "http://uppedevents.com",
        "image": "upped.png",
        "description": "An enterprise-grade event management platform orchestrating the entire event lifecycle. From ticketing and vendor onboarding to staff allocation and real-time operations, Upped provides a unified command center for organizers. Key features include secure ticket validation, merchandise management, and advanced analytics dashboards that provide actionable insights for data-driven decision-making.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Gigipo",
        "link": "https://dev.gigipo.com",
        "image": "gigipo.png",
        "description": "An interactive ed-tech platform connecting expert mentors with students across disciplines like Arts and Music. The system integrates JITSI Meet for high-quality, secure video conferencing, enabling seamless virtual classrooms. Features include instant session booking, resource sharing, and a 'Gift a Class' functionality, streamlining the learning experience for a global audience.",
        "technologies": ["React", "NodeJs", "Mysql", "MongoDB"]
      }
    ],
    "services": [
      {
        "title": "Innovative Solutions",
        "description": "Transforming abstract concepts into tangible, high-impact digital realities through creative problem-solving and technical innovation.",
        "icon": "icon-bulb",
        "colorClass": "color-1"
      },
      {
        "title": "Software Development",
        "description": "Architecting robust, scalable, and efficient codebases that solve complex user problems and streamline business operations.",
        "icon": "icon-data",
        "colorClass": "color-2"
      },
      {
        "title": "Technical Mentorship",
        "description": "Passionate about fostering talent, I dedicate time to mentoring fellow developers, conducting code reviews, and elevating team capabilities.",
        "icon": "icon-phone3",
        "colorClass": "color-3"
      },
      {
        "title": "Angular Expertise",
        "description": "Deep expertise since 2017, delivering enterprise-grade applications and contributing to the open-source community via NPM packages.",
        "icon": "icon-angular",
        "colorClass": "color-4"
      },
      {
        "title": "Node.js Architecture",
        "description": "Building high-performance backend systems since 2017, with extensive experience in Express.js and Hapi.js for scalable microservices.",
        "icon": "icon-nodejs",
        "colorClass": "color-5"
      },
      {
        "title": "React Ecosystem",
        "description": "Developing dynamic, responsive, and user-centric frontend interfaces since 2018, specializing in modern React patterns and performance.",
        "icon": "icon-react",
        "colorClass": "color-6"
      }
    ]
  }
}