{
  "success": true,
  "data": {
    "name": "Inder",
    "lastName": "Singh",
    "fullName": "Mr. Inderpal Singh",
    "role": "Full Stack Developer",
    "totalExperience": 12,
    "profilePic": "/assets/images/profile.jpg",
    "linkedin": "https://linkedin.com/in/ips13",
    "twitter": "",
    "facebook": "",
    "instagram": "",
    "intro": "<strong>Senior Full Stack Developer</strong> with 12+ years of experience designing and scaling high-performance web applications. Expert in JS, Angular, React, Node.js, Java and Python, with a proven track record of delivering mission-critical solutions for industry giants including events.com, Cisco, and Lucid Motors.",
    "description": "Specialized in migrating large-scale datasets (2TB+), optimizing API architecture, and driving Agile adoption to increase team productivity by 30%.",
    "educations": [
      {
        "title": "Bachelor of Science in IT (BSc IT)",
        "institute": "Kalinga University",
        "startDate": "2014-01-01T00:00:00.0Z",
        "endDate": "2016-01-01T00:00:00.0Z",
        "state": "Raipur, India",
        "totalSems": 4,
        "description": "Graduated with a focus on Information Technology.",
        "points": []
      },
      {
        "title": "Diploma in Information Technology (DIT)",
        "institute": "Punjab Infotech",
        "startDate": "2012-01-01T00:00:00.0Z",
        "endDate": "2013-01-01T00:00:00.0Z",
        "state": "Mohali, Punjab",
        "totalSems": 2,
        "description": "Gained a solid foundation in the field of Information Technology.",
        "points": []
      }
    ],
    "experiences": [
      {
        "title": "Senior Full Stack Developer (Contract)",
        "description": "Clients: events.com, Cisco, Lucid Motors, Upped Events. Architected a comprehensive event management software solution facilitating ticket sales, staff management, and operations. Spearheaded the development of the award-winning “Master Boot Record (MBR)” application for Cisco. Engineered a multi-country Point of Sale (POS) system using Ionic, Node.js, and React for Lucid Motors. Managed the seamless migration of Canada’s largest survey platform (2 TB of data) from SQL to a modernized, indexed MySQL database on AWS. Developed a car listing platform using Angular and Laravel (Motoview).",
        "company": "Professional Services",
        "address": "Remote / Mohali, India",
        "startDate": "2021-06-01T00:00:00.0Z",
        "endDate": "Present",
        "projects": [],
        "roles": [],
        "technologies": [
          "Angular",
          "React",
          "NodeJs",
          "Docker",
          "AWS",
          "Git",
          "Ionic",
          "Laravel"
        ]
      },
      {
        "title": "Technical Lead",
        "description": "Led a team of technical developers in building scalable applications, conducting weekly code reviews, and ensuring timely delivery of milestones. Championed the adoption of Agile methodologies, resulting in a 30% increase in team productivity within six months. Served as the primary technical point of contact for clients, translating feedback into actionable development tasks.",
        "company": "Illuminz",
        "address": "Mohali, Punjab",
        "startDate": "2018-06-01T00:00:00.0Z",
        "endDate": "2021-05-01T00:00:00.0Z",
        "projects": [],
        "roles": [],
        "technologies": [
          "Angular",
          "NodeJs",
          "PHP"
        ]
      },
      {
        "title": "Senior Software Developer",
        "description": "Collaborated with sales and leadership to define project direction and timelines for a diverse portfolio of medium-to-large scale applications, ensuring technical feasibility. Successfully built and maintained diverse customer-facing applications across multiple programming languages. Managed User Acceptance Testing (UAT) and implementation phases to ensure zero-defect delivery.",
        "company": "Webclouds",
        "address": "Mohali, Punjab",
        "startDate": "2013-10-01T00:00:00.0Z",
        "endDate": "2018-05-01T00:00:00.0Z",
        "projects": [],
        "roles": [],
        "technologies": [
          "PHP",
          "JS",
          "Wordpress",
          "Magento"
        ]
      }
    ],
    "skills": [
      {
        "name": "Node.JS",
        "percent": 100,
        "slug": "nodejs"
      },
      {
        "name": "Angular",
        "percent": 100,
        "slug": "angular"
      },
      {
        "name": "ReactJS",
        "percent": 100,
        "slug": "react"
      },
      {
        "name": "PHP (Laravel)",
        "percent": 100,
        "slug": "php"
      },
      {
        "name": "Python",
        "percent": 90,
        "slug": "python"
      },
      {
        "name": "Java",
        "percent": 80,
        "slug": "java"
      },
      {
        "name": "Ionic",
        "percent": 90,
        "slug": "ionic"
      },
      {
        "name": "React Native",
        "percent": 80,
        "slug": "reactnative"
      },
      {
        "name": "SQL (MySql, PostgreSQL)",
        "percent": 100,
        "slug": "mysql"
      },
      {
        "name": "NoSQL (MongoDB)",
        "percent": 100,
        "slug": "nosql"
      },
      {
        "name": "HTML5",
        "percent": 100,
        "slug": "html"
      },
      {
        "name": "CSS3",
        "percent": 100,
        "slug": "css"
      },
      {
        "name": "AWS",
        "percent": 95,
        "slug": "aws"
      },
      {
        "name": "Docker",
        "percent": 80,
        "slug": "docker"
      },
      {
        "name": "Jenkins / CI/CD",
        "percent": 70,
        "slug": "jenkins"
      },
      {
        "name": "Microservices",
        "percent": 80,
        "slug": "microservices"
      },
      {
        "name": "Wordpress",
        "percent": 100,
        "slug": "wordpress"
      },
      {
        "name": "Shopify",
        "percent": 80,
        "slug": "shopify"
      },
      {
        "name": "Laravel",
        "percent": 100,
        "slug": "laravel"
      },
      {
        "name": "Magento",
        "percent": 90,
        "slug": "magento"
      },
      {
        "name": "CakePHP",
        "percent": 85,
        "slug": "cakephp"
      }
    ],
    "projects": [
      {
        "name": "Motoview",
        "link": "https://motoview.com",
        "image": "motoview.png",
        "description": "Motoview features a comprehensive listing of cars from various prestigious motor shows, where leading automobile companies worldwide present their latest designs and future concepts. We retrieve a diverse array of car listings from the Iceberg API and store them in our Motoview database. Users can conveniently compare multiple cars side by side, exploring all available features. Additionally, they can sign up, interact by liking or disliking, and comment on different aspects of the cars showcased.",
        "technologies": ["Angular", "Lumen", "Mysql"]
      },
      {
        "name": "Ethnico",
        "link": "https://ethnico.in",
        "image": "ethnico.png",
        "description": "Ethnico is a holistic platform that offers both customized and ready-made clothing options. It connects artisans, boutiques, and clothing houses throughout Chennai with individuals seeking bespoke stitching and tailored experiences. Ethnico serves as a comprehensive platform for both end-users and vendors alike. It provides users with the convenience of shopping for readymade garments and bespoke stitching options from the comfort of their homes, eliminating the need to visit physical stores.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Lex Chatbot",
        "image": "lexbot.png",
        "description": "The chatbot is designed to collect feedback for various Canadian surveys. It analyzes user responses to detect sentiment—whether positive or negative—and tailors subsequent questions accordingly to gather more details about their experience. The chatbot features a progress bar that continues asking questions up to five times or until a certain word count is reached. To achieve this, I developed a unique Lambda/Python script that structures sentences using proper English grammar and syntax.",
        "technologies": ["AWS Lambda", "Python", "DynamoDB"]
      },
      {
        "name": "Delivery Papa",
        "link": "http://dp.illuminz.com",
        "image": "delivery-papa.png",
        "description": "This is a multi-vendor system designed for online food sales by various companies operating from their respective outlets. Each vendor manages a separate database to track and fulfill orders. Orders can be assigned to delivery partners via multiple delivery services, offering live tracking capabilities. The system includes options for table reservations/booking and a point-of-sale (POS) facility, allowing users to purchase food directly from restaurants. It also features a loyalty program where users earn tier upgrades based on their purchases, unlocking exciting offers and discounts. Companies can promote their businesses through social and marketing campaigns integrated into the platform.",
        "technologies": ["Angular", "NodeJs", "React", "NextJS", "Mysql", "MongoDB"]
      },
      {
        "name": "Upped Events",
        "link": "http://uppedevents.com",
        "image": "upped.png",
        "description": "It's a comprehensive event management system that handles everything from online ticket sales to the management of event owners, vendors, staff, and customers. Users can easily discover and book tickets or slots for ongoing events in their area. Event organizers and companies can create events, enlist vendors either internally or through Upped, and assign staff to manage various aspects. The system efficiently manages operations such as ticket validation and merchandise purchases. Advanced analytics provide businesses with detailed insights into their operations, empowering them to make informed decisions.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Gigipo",
        "link": "https://dev.gigipo.com",
        "image": "gigipo.png",
        "description": "It's an online coaching platform where teachers can register and offer classes in various categories such as Art, Music, and more. Users can browse through the list of available classes, book slots, or start instant sessions with teachers by making payments. The platform utilizes JITSI Meet, an open-source video conferencing technology, to create dedicated rooms for seamless video calls between teachers and students. During sessions, teachers can share notes and other relevant information with their students. Additionally, the platform includes a <strong>Gift a Class</strong> feature, allowing users to purchase classes for others and manage payments seamlessly.",
        "technologies": ["React", "NodeJs", "Mysql", "MongoDB"]
      }
    ]
  }
}