{
  "success": true,
  "data": {
    "name": "Inder",
    "lastName": "Singh",
    "fullName": "Mr. Inderpal Singh",
    "role": "Full Stack Developer",
    "profilePic": "/assets/images/profile.jpg",
    "linkedin": "https://www.linkedin.com/in/ips17009",
    "twitter": "",
    "facebook": "",
    "instagram": "",
    "intro": "<strong>Hi I'm Inder Pal Singh</strong> from Punjab. I have 10 years of experience in development. I began my career with PHP development and have always been keen to learn different technologies. This curiosity led me to switch to frontend JavaScript frameworks. In 2016, I completed my first project with Node.js and subsequently started working with Angular and React.js. After years of experience and continuous learning, I am now proud to represent myself as a Full Stack Developer.",
    "description": "Starting my career as a PHP developer, I worked with various technologies and frameworks, developing numerous plugins and themes in WordPress. In 2017, I transitioned to JavaScript frameworks, specifically Angular and React. Subsequently, I began working with both backend and frontend technologies. Today, I am a Full Stack Developer in website and app development, proficient in six programming languages, with more on the way.",
    "educations": [
      {
        "title": "Bachelor Degree of Computre Science & Information Technology (BSC.IT)",
        "institute": "Kalinga University",
        "startDate": "2014-06-01T13:13:13.0Z",
        "endDate": "2016-06-01T13:13:13.0Z",
        "state": "Chhattisgarh",
        "totalSems": 4,
        "description": "After completing my diploma, I started my career in development. A few months later, I was admitted directly into the second year of a B.Sc. in Information Technology based on my diploma. I graduated with a 67.14% and gained substantial knowledge in the field of Information Technology.",
        "points": ["Math", "Made project of shopping cart"]
      },
      {
        "title": "Diploma in Information Technology (DIT)",
        "institute": "Kalinga University",
        "startDate": "2012-10-01T13:13:13.0Z",
        "endDate": "2013-10-01T13:13:13.0Z",
        "state": "Punjab",
        "totalSems": 2,
        "description": "After completing my senior secondary education, I pursued a degree in Information Technology to deepen my understanding of computers. I graduated with a 73.42% and gained a solid foundation in the field. I always aspired to be a software engineer but was unsure where to begin. This course provided the perfect starting point, offering industrial training and coaching in PHP and MySQL, which helped launch my career.",
        "points": ["Industrial Training", "Communicating Skills", "PHP, Mysql training"]
      },
      {
        "title": "Senior Secondary School",
        "institute": "3b1 Govt. Modal Senior Secondary, Mohali",
        "board": "PSEB",
        "startDate": "2012-10-01T13:13:13.0Z",
        "endDate": "2013-10-01T13:13:13.0Z",
        "state": "Punjab",
        "totalSems": 2,
        "description": "I completed my Senior Secondary education in 2012 with a focus on Non-Medical subjects. Initially, I explored the commerce stream, but found it uninteresting, particularly the CA curriculum. Seeking more engaging challenges, I shifted my focus to Science and Technology, choosing the Non-Medical stream. I graduated with a 70%.",
        "points": ["Non-Medical", "Math", "Science", "Cricket player of school team"]
      },
      {
        "title": "High School",
        "institute": "JVS (Sectore-71 Mohali)",
        "board": "PSEB",
        "startDate": "2012-10-01T13:13:13.0Z",
        "endDate": "2013-10-01T13:13:13.0Z",
        "state": "Punjab",
        "totalSems": 2,
        "description": "I completed high school in 2010, achieving a 70.21%. During my school years, I actively participated in various outdoor sports events.",
        "points": ["Math","Cricket player of school team"]
      }
    ],
    "experiences": [
      {
        "title": "Senior Fullstack Developer",
        "description": "Now I'm working as full time freelancer and provide professional services and support to biggest tech companies on contract basis. My recent work includes the companies <strong>Cisco, Lucid Motors, TCS, Events.com</strong>",
        "company": "Professional Services",
        "address": "Mohali, Punjab, India",
        "startDate": "2021-06-01T13:13:13.0Z",
        "endDate": "2024-06-01T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          "Angular",
          "React",
          "NodeJs",
          "Docker",
          "AWS",
          "Git"
        ]
      },
      {
        "title": "Technical Lead Manager",
        "description": "My responsibilities included leading a team of technical developers and assisting them in solving problems. I communicated with clients, listened to their feedback, and discussed all project-related matters. I provided weekly demos and discussed upcoming milestones to ensure the delivery of high-quality, on-time work. My goal was always to meet and exceed client expectations.",
        "company": "Illuminz",
        "address": "#F-213 Phase-8, Mohali, Punjab, India",
        "startDate": "2018-06-07T13:13:13.0Z",
        "endDate": "2021-05-31T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          "Angular",
          "NodeJs",
          "PHP"
        ]
      },
      {
        "title": "Senior Software Engineer",
        "description": "I worked as a Senior Software Engineer, where I handled various technologies and collaborated with sales and team leads to provide accurate directions, timelines, and availability assessments.",
        "company": "Deftsoft",
        "address": "#E-286 Phase-8 A, Mohali, Punjab, India",
        "startDate": "2017-01-23T13:13:13.0Z",
        "endDate": "2018-05-19T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          "PHP",
          "JS"
        ]
      },
      {
        "title": "Senior Software Developer",
        "description": "I began my development journey at Webclouds as a trainee in PHP development. Within 20 days, I completed the assigned syllabus and was entrusted with live projects. My first project, a WordPress site, was completed single-handedly in just four days.",
        "company": "Webclouds",
        "address": "SCO 34-C, Kharar, Mohali, Punjab, India",
        "startDate": "2013-01-23T13:13:13.0Z",
        "endDate": "2016-10-03T13:13:13.0Z",
        "projects": [
  
        ],
        "roles": [
  
        ],
        "technologies": [
          "PHP",
          "JS",
          "Wordpress",
          "Magento",
          "Drupal",
          "Joomla",
          "Ontraport",
          "Volusion",
          "ClickBank"
        ]
      }
    ],
    "skills": [
      {
        "name": "Node.JS",
        "percent": 100,
        "slug": "nodejs"
      },
      {
        "name": "Angular",
        "percent": 100,
        "slug": "angular"
      },
      {
        "name": "ReactJS",
        "percent": 100,
        "slug": "react"
      },
      {
        "name": "PHP",
        "percent": 100,
        "slug": "php"
      },
      {
        "name": "Python",
        "percent": 90,
        "slug": "python"
      },
      {
        "name": "Ionic",
        "percent": 90,
        "slug": "ionic"
      },
      {
        "name": "React Native",
        "percent": 80,
        "slug": "reactnative"
      },
      {
        "name": "PhoneGap",
        "percent": 70,
        "slug": "phonegap"
      },
      {
        "name": "SQL (MySql, MsSql, MariaDB)",
        "percent": 100,
        "slug": "mysql"
      },
      {
        "name": "NoSQL (MongoDB, Dynamodb)",
        "percent": 100,
        "slug": "nosql"
      },
      {
        "name": "HTML",
        "percent": 100,
        "slug": "html"
      },
      {
        "name": "CSS",
        "percent": 100,
        "slug": "css"
      },
      {
        "name": "AWS (IAAS, PAAS, SAAS, RDS)",
        "percent": 95,
        "slug": "aws"
      },
      {
        "name": "Google Cloud (Instances)",
        "percent": 80,
        "slug": "gcloud"
      },
      {
        "name": "Cpanels (SSH, Files)",
        "percent": 100,
        "slug": "cpanel"
      },
      {
        "name": "Docker",
        "percent": 70,
        "slug": "docker"
      },
      {
        "name": "Kubernetes",
        "percent": 60,
        "slug": "kubernetes"
      },
      {
        "name": "Wordpress",
        "percent": 100,
        "slug": "wordpress"
      },
      {
        "name": "Laravel",
        "percent": 95,
        "slug": "laravel"
      },
      {
        "name": "Magento (v1 & v2)",
        "percent": 90,
        "slug": "magento"
      },
      {
        "name": "Bigcommerce",
        "percent": 90,
        "slug": "bigcommerce"
      },
      {
        "name": "Codeigniter",
        "percent": 80,
        "slug": "codeigniter"
      },
      {
        "name": "CakePHP",
        "percent": 80,
        "slug": "cakephp"
      },
      {
        "name": "Shopify",
        "percent": 80,
        "slug": "shopify"
      },
      {
        "name": "Drupal",
        "percent": 70,
        "slug": "drupal"
      },
      {
        "name": "Opencart",
        "percent": 70,
        "slug": "opencart"
      },
      {
        "name": "Nationbuilder",
        "percent": 60,
        "slug": "nationbuilder"
      }
    ],
    "projects": [
      {
        "name": "Motoview",
        "link": "https://motoview.com",
        "image": "motoview.png",
        "description": "Motoview features a comprehensive listing of cars from various prestigious motor shows, where leading automobile companies worldwide present their latest designs and future concepts. We retrieve a diverse array of car listings from the Iceberg API and store them in our Motoview database. Users can conveniently compare multiple cars side by side, exploring all available features. Additionally, they can sign up, interact by liking or disliking, and comment on different aspects of the cars showcased.",
        "technologies": ["Angular", "Lumen", "Mysql"]
      },
      {
        "name": "Ethnico",
        "link": "https://ethnico.in",
        "image": "ethnico.png",
        "description": "Ethnico is a holistic platform that offers both customized and ready-made clothing options. It connects artisans, boutiques, and clothing houses throughout Chennai with individuals seeking bespoke stitching and tailored experiences. Ethnico serves as a comprehensive platform for both end-users and vendors alike. It provides users with the convenience of shopping for readymade garments and bespoke stitching options from the comfort of their homes, eliminating the need to visit physical stores.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Lex Chatbot",
        "image": "lexbot.png",
        "description": "The chatbot is designed to collect feedback for various Canadian surveys. It analyzes user responses to detect sentiment—whether positive or negative—and tailors subsequent questions accordingly to gather more details about their experience. The chatbot features a progress bar that continues asking questions up to five times or until a certain word count is reached. To achieve this, I developed a unique Lambda/Python script that structures sentences using proper English grammar and syntax.",
        "technologies": ["AWS Lambda", "Python", "DynamoDB"]
      },
      {
        "name": "Delivery Papa",
        "link": "http://dp.illuminz.com",
        "image": "delivery-papa.png",
        "description": "This is a multi-vendor system designed for online food sales by various companies operating from their respective outlets. Each vendor manages a separate database to track and fulfill orders. Orders can be assigned to delivery partners via multiple delivery services, offering live tracking capabilities. The system includes options for table reservations/booking and a point-of-sale (POS) facility, allowing users to purchase food directly from restaurants. It also features a loyalty program where users earn tier upgrades based on their purchases, unlocking exciting offers and discounts. Companies can promote their businesses through social and marketing campaigns integrated into the platform.",
        "technologies": ["Angular", "NodeJs", "React", "NextJS", "Mysql", "MongoDB"]
      },
      {
        "name": "Upped Events",
        "link": "http://uppedevents.com",
        "image": "upped.png",
        "description": "It's a comprehensive event management system that handles everything from online ticket sales to the management of event owners, vendors, staff, and customers. Users can easily discover and book tickets or slots for ongoing events in their area. Event organizers and companies can create events, enlist vendors either internally or through Upped, and assign staff to manage various aspects. The system efficiently manages operations such as ticket validation and merchandise purchases. Advanced analytics provide businesses with detailed insights into their operations, empowering them to make informed decisions.",
        "technologies": ["Angular", "NodeJs", "Mysql", "MongoDB"]
      },
      {
        "name": "Gigipo",
        "link": "https://dev.gigipo.com",
        "image": "gigipo.png",
        "description": "It's an online coaching platform where teachers can register and offer classes in various categories such as Art, Music, and more. Users can browse through the list of available classes, book slots, or start instant sessions with teachers by making payments. The platform utilizes JITSI Meet, an open-source video conferencing technology, to create dedicated rooms for seamless video calls between teachers and students. During sessions, teachers can share notes and other relevant information with their students. Additionally, the platform includes a <strong>Gift a Class</strong> feature, allowing users to purchase classes for others and manage payments seamlessly.",
        "technologies": ["React", "NodeJs", "Mysql", "MongoDB"]
      }
    ]
  }
}